Revit 2027 API
FailuresAccessor.IsElementsDeletionPermitted Method
 Checks if resolution of the failures by deleting failure elements is permitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElementsDeletionPermitted()
Public Function IsElementsDeletionPermitted As Boolean
public:
bool IsElementsDeletionPermitted()
member IsElementsDeletionPermitted : unit -> bool
Return Value
Boolean
 True if resolution of the failures by deleting failure elements is permitted.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
Reference
FailuresAccessor Class
IsElementsDeletionPermitted Overload
Autodesk.Revit.DB Namespace